In [166]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [167]:
test=pd.read_excel('Test_set3.xlsx')
test.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info
0,Jet Airways,6/06/2019,Delhi,Cochin,DEL → BOM → COK,17:30,04:25 07 Jun,10h 55m,1 stop,No info
1,IndiGo,12/05/2019,Kolkata,Banglore,CCU → MAA → BLR,06:20,10:20,4h,1 stop,No info
2,Jet Airways,21/05/2019,Delhi,Cochin,DEL → BOM → COK,19:15,19:00 22 May,23h 45m,1 stop,In-flight meal not included
3,Multiple carriers,21/05/2019,Delhi,Cochin,DEL → BOM → COK,08:00,21:00,13h,1 stop,No info
4,Air Asia,24/06/2019,Banglore,Delhi,BLR → DEL,23:55,02:45 25 Jun,2h 50m,non-stop,No info

In [168]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2671 entries, 0 to 2670
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          2671 non-null   object
 1   Date_of_Journey  2671 non-null   object
 2   Source           2671 non-null   object
 3   Destination      2671 non-null   object
 4   Route            2671 non-null   object
 5   Dep_Time         2671 non-null   object
 6   Arrival_Time     2671 non-null   object
 7   Duration         2671 non-null   object
 8   Total_Stops      2671 non-null   object
 9   Additional_Info  2671 non-null   object
dtypes: object(10)
memory usage: 208.8+ KB

In [169]:
test.columns

Index(['Airline', 'Date_of_Journey', 'Source', 'Destination', 'Route',
       'Dep_Time', 'Arrival_Time', 'Duration', 'Total_Stops',
       'Additional_Info'],
      dtype='object')

In [170]:
test.shape

(2671, 10)

In [171]:
train=pd.read_excel('Data_Train3.xlsx')
train.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [172]:
train.shape

(10683, 11)

In [173]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
dtypes: int64(1), object(10)
memory usage: 918.2+ KB

In [174]:
fdata=pd.concat([train,test],ignore_index=True)

In [175]:
fdata.shape

(13354, 11)

In [176]:
fdata.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882.0
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218.0
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302.0

In [177]:
fdata.isnull().sum()

Airline               0
Date_of_Journey       0
Source                0
Destination           0
Route                 1
Dep_Time              0
Arrival_Time          0
Duration              0
Total_Stops           1
Additional_Info       0
Price              2671
dtype: int64

In [178]:
#FEATURE ENGINNERING
# 1. DATE FORMATING
fdata.Date_of_Journey

0        24/03/2019
1         1/05/2019
2         9/06/2019
3        12/05/2019
4        01/03/2019
            ...
13349     6/06/2019
13350    27/03/2019
13351     6/03/2019
13352     6/03/2019
13353    15/06/2019
Name: Date_of_Journey, Length: 13354, dtype: object

"date is in object format we have to change it into date time format"

In [179]:
fdata['Date']=fdata['Date_of_Journey'].str.split('/').str[0]  #str[0]: index of zeroth date 
fdata.Date.str[0]

0        2
1        1
2        9
3        1
4        0
        ..
13349    6
13350    2
13351    6
13352    6
13353    1
Name: Date, Length: 13354, dtype: object

In [180]:
fdata['Month']=fdata['Date_of_Journey'].str.split('/').str[1]  #str[0]: index of first date
fdata.Month.str[1]

0        3
1        5
2        6
3        5
4        3
        ..
13349    6
13350    3
13351    3
13352    3
13353    6
Name: Month, Length: 13354, dtype: object

In [181]:
fdata['Year']=fdata['Date_of_Journey'].str.split('/').str[2]  #str[2]: index of second date
fdata.Year.str[2]

0        1
1        1
2        1
3        1
4        1
        ..
13349    1
13350    1
13351    1
13352    1
13353    1
Name: Year, Length: 13354, dtype: object

In [182]:
fdata.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,03,2019
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0,1,05,2019

In [183]:
fdata['Date']=fdata['Date'].astype(int)

fdata['Month']=fdata['Month'].astype(int)

fdata['Year']=fdata['Year'].astype(int)

In [184]:
fdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13354 entries, 0 to 13353
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Date_of_Journey  13354 non-null  object
 2   Source           13354 non-null  object
 3   Destination      13354 non-null  object
 4   Route            13353 non-null  object
 5   Dep_Time         13354 non-null  object
 6   Arrival_Time     13354 non-null  object
 7   Duration         13354 non-null  object
 8   Total_Stops      13353 non-null  object
 9   Additional_Info  13354 non-null  object
 10  Price            10683 non-null  float64
 11  Date             13354 non-null  int32
 12  Month            13354 non-null  int32
 13  Year             13354 non-null  int32
dtypes: float64(1), int32(3), object(10)
memory usage: 1.3+ MB

In [185]:
fdata.drop('Date_of_Journey',axis=1,inplace=True)

In [186]:
fdata.head()

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,3,2019
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0,1,5,2019
2,Jet Airways,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882.0,9,6,2019
3,IndiGo,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218.0,12,5,2019
4,IndiGo,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302.0,1,3,2019

In [187]:
fdata.head(4)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,3,2019
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0,1,5,2019
2,Jet Airways,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882.0,9,6,2019
3,IndiGo,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218.0,12,5,2019

In [188]:
fdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13354 entries, 0 to 13353
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Source           13354 non-null  object
 2   Destination      13354 non-null  object
 3   Route            13353 non-null  object
 4   Dep_Time         13354 non-null  object
 5   Arrival_Time     13354 non-null  object
 6   Duration         13354 non-null  object
 7   Total_Stops      13353 non-null  object
 8   Additional_Info  13354 non-null  object
 9   Price            10683 non-null  float64
 10  Date             13354 non-null  int32
 11  Month            13354 non-null  int32
 12  Year             13354 non-null  int32
dtypes: float64(1), int32(3), object(9)
memory usage: 1.2+ MB

In [189]:
fdata.head()

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,3,2019
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0,1,5,2019
2,Jet Airways,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882.0,9,6,2019
3,IndiGo,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218.0,12,5,2019
4,IndiGo,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302.0,1,3,2019

In [190]:
fdata['Duration'].head()

0    2h 50m
1    7h 25m
2       19h
3    5h 25m
4    4h 45m
Name: Duration, dtype: object

In [191]:
fdata['Duration_hr']=fdata['Duration'].str.split(' ').str[0]
fdata['Duration_min']=fdata['Duration'].str.split(' ').str[1]

In [192]:
fdata['Duration'].head()

0    2h 50m
1    7h 25m
2       19h
3    5h 25m
4    4h 45m
Name: Duration, dtype: object

In [193]:
fdata['Duration_hr']=fdata['Duration_hr'].str.split('h').str[0]
fdata['Duration_min']=fdata['Duration_min'].str.split('m').str[0]

In [194]:
fdata['Duration_hr'].head()

0     2
1     7
2    19
3     5
4     4
Name: Duration_hr, dtype: object

In [195]:
fdata['Duration_min']

0         50
1         25
2        NaN
3         25
4         45
        ...
13349     55
13350     35
13351     35
13352     15
13353     20
Name: Duration_min, Length: 13354, dtype: object

THERE ARE NAN VALUES IN MIN BECAUSE SOME CASE THERE IS NO MIN IS RECOORD

In [196]:
fdata['Duration_min']=fdata['Duration_min'].fillna(0)

In [197]:
fdata['Duration_min'].isnull().sum()

0

In [198]:
fdata['Duration_hr'].isnull().sum()

0

In [199]:
fdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13354 entries, 0 to 13353
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Source           13354 non-null  object
 2   Destination      13354 non-null  object
 3   Route            13353 non-null  object
 4   Dep_Time         13354 non-null  object
 5   Arrival_Time     13354 non-null  object
 6   Duration         13354 non-null  object
 7   Total_Stops      13353 non-null  object
 8   Additional_Info  13354 non-null  object
 9   Price            10683 non-null  float64
 10  Date             13354 non-null  int32
 11  Month            13354 non-null  int32
 12  Year             13354 non-null  int32
 13  Duration_hr      13354 non-null  object
 14  Duration_min     13354 non-null  object
dtypes: float64(1), int32(3), object(11)
memory usage: 1.4+ MB

In [200]:
fdata.head(2)
#no use of duration column so we drop it

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Duration_hr,Duration_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,3,2019,2,50
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0,1,5,2019,7,25

In [201]:
fdata.drop('Duration',axis=1,inplace=True)

In [202]:
if 'Duration' in fdata.columns:
    print('exist')
else:
    print('not exist')

not exist

In [203]:
#SPLITING ARIVAL TIME
fdata['Arrival_Time'].head()

0    01:10 22 Mar
1           13:15
2    04:25 10 Jun
3           23:30
4           21:35
Name: Arrival_Time, dtype: object

In [204]:
fdata['Arrival_Times']=fdata['Arrival_Time'].str.split(' ')
fdata['Arrival_Time'].head()

0    01:10 22 Mar
1           13:15
2    04:25 10 Jun
3           23:30
4           21:35
Name: Arrival_Time, dtype: object

In [205]:
fdata['Arrival_hr']=fdata['Arrival_Time'].str.split(':').str[0]

In [206]:
fdata['Arrival_hr'].head()

0    01
1    13
2    04
3    23
4    21
Name: Arrival_hr, dtype: object

In [207]:
fdata['Arrival_mins']=fdata['Arrival_Time'].str.split(' ').str[0]
fdata['Arrival_mins']
#we get time now but we need min only because hr column is already we create

0        01:10
1        13:15
2        04:25
3        23:30
4        21:35
         ...
13349    20:25
13350    16:55
13351    04:25
13352    19:15
13353    19:15
Name: Arrival_mins, Length: 13354, dtype: object

In [208]:
fdata['Arrival_min']=fdata['Arrival_mins'].str.split(':').str[1]

In [209]:
#MINEUTE IS NOT YET SPLIT BY DATES
fdata['Arrival_min'].head()

0    10
1    15
2    25
3    30
4    35
Name: Arrival_min, dtype: object

In [210]:
fdata.columns

Index(['Airline', 'Source', 'Destination', 'Route', 'Dep_Time', 'Arrival_Time',
       'Total_Stops', 'Additional_Info', 'Price', 'Date', 'Month', 'Year',
       'Duration_hr', 'Duration_min', 'Arrival_Times', 'Arrival_hr',
       'Arrival_mins', 'Arrival_min'],
      dtype='object')

In [211]:
fdata.drop('Arrival_mins',axis=1,inplace=True)

In [212]:
fdata.drop('Arrival_Times',axis=1,inplace=True)

In [213]:
fdata.drop('Arrival_Time',axis=1,inplace=True)

In [214]:
fdata.columns

Index(['Airline', 'Source', 'Destination', 'Route', 'Dep_Time', 'Total_Stops',
       'Additional_Info', 'Price', 'Date', 'Month', 'Year', 'Duration_hr',
       'Duration_min', 'Arrival_hr', 'Arrival_min'],
      dtype='object')

In [215]:
fdata.head(2)

,Airline,Source,Destination,Route,Dep_Time,Total_Stops,Additional_Info,Price,Date,Month,Year,Duration_hr,Duration_min,Arrival_hr,Arrival_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,non-stop,No info,3897.0,24,3,2019,2,50,01,10
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,2 stops,No info,7662.0,1,5,2019,7,25,13,15

In [216]:
fdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13354 entries, 0 to 13353
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Source           13354 non-null  object
 2   Destination      13354 non-null  object
 3   Route            13353 non-null  object
 4   Dep_Time         13354 non-null  object
 5   Total_Stops      13353 non-null  object
 6   Additional_Info  13354 non-null  object
 7   Price            10683 non-null  float64
 8   Date             13354 non-null  int32
 9   Month            13354 non-null  int32
 10  Year             13354 non-null  int32
 11  Duration_hr      13354 non-null  object
 12  Duration_min     13354 non-null  object
 13  Arrival_hr       13354 non-null  object
 14  Arrival_min      13354 non-null  object
dtypes: float64(1), int32(3), object(11)
memory usage: 1.4+ MB

"""still last four columns are in object changed it to int"""

In [219]:
fdata['Duration_min']=fdata['Duration_min'].astype(int)

In [220]:
fdata['Arrival_hr']=fdata['Arrival_hr'].astype(int)

In [221]:
fdata['Arrival_min']=fdata['Arrival_min'].astype(int)

In [222]:
fdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13354 entries, 0 to 13353
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Source           13354 non-null  object
 2   Destination      13354 non-null  object
 3   Route            13353 non-null  object
 4   Dep_Time         13354 non-null  object
 5   Total_Stops      13353 non-null  object
 6   Additional_Info  13354 non-null  object
 7   Price            10683 non-null  float64
 8   Date             13354 non-null  int32
 9   Month            13354 non-null  int32
 10  Year             13354 non-null  int32
 11  Duration_hr      13352 non-null  float64
 12  Duration_min     13354 non-null  int32
 13  Arrival_hr       13354 non-null  int32
 14  Arrival_min      13354 non-null  int32
dtypes: float64(2), int32(6), object(7)
memory usage: 1.2+ MB

In [223]:
#SPLITING FOR DEP_TIME
fdata['Dep_Time'].head()

0    22:20
1    05:50
2    09:25
3    18:05
4    16:50
Name: Dep_Time, dtype: object

In [224]:
fdata['Dep_hr']=fdata['Dep_Time'].str.split(':').str[0]
fdata['Dep_min']=fdata['Dep_Time'].str.split(':').str[1]

In [225]:
fdata.head(2)

,Airline,Source,Destination,Route,Dep_Time,Total_Stops,Additional_Info,Price,Date,Month,Year,Duration_hr,Duration_min,Arrival_hr,Arrival_min,Dep_hr,Dep_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,non-stop,No info,3897.0,24,3,2019,2.0,50,1,10,22,20
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,2 stops,No info,7662.0,1,5,2019,7.0,25,13,15,05,50

In [226]:
fdata['Dep_hr']=fdata['Dep_hr'].astype(int)

In [227]:
fdata['Dep_min']=fdata['Dep_min'].astype(int)

In [228]:
fdata.drop('Dep_Time' , axis=1,inplace=True)

In [229]:
fdata.head(1)

,Airline,Source,Destination,Route,Total_Stops,Additional_Info,Price,Date,Month,Year,Duration_hr,Duration_min,Arrival_hr,Arrival_min,Dep_hr,Dep_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,non-stop,No info,3897.0,24,3,2019,2.0,50,1,10,22,20

In [230]:
fdata['Route'].head()
#NO NEED OF THIS COLUMN JUST DROP IT

0                BLR → DEL
1    CCU → IXR → BBI → BLR
2    DEL → LKO → BOM → COK
3          CCU → NAG → BLR
4          BLR → NAG → DEL
Name: Route, dtype: object

In [231]:
fdata[fdata['Total_Stops'].isnull()]

,Airline,Source,Destination,Route,Total_Stops,Additional_Info,Price,Date,Month,Year,Duration_hr,Duration_min,Arrival_hr,Arrival_min,Dep_hr,Dep_min
9039,Air India,Delhi,Cochin,NaN,NaN,No info,7480.0,6,5,2019,23.0,40,9,25,9,45

In [232]:
fdata['Total_Stops'].unique()

array(['non-stop', '2 stops', '1 stop', '3 stops', nan, '4 stops'],
      dtype=object)

In [233]:
fdata['Total_Stop']=fdata['Total_Stops'].map({'non-stop':0 ,'1 stop':1 ,'2 stops':2 , '3 stops':3 , '4 stops': 4})

In [234]:
fdata['Total_Stop']=fdata['Total_Stop'].fillna(1)

In [235]:
fdata.isnull().sum()

Airline               0
Source                0
Destination           0
Route                 1
Total_Stops           1
Additional_Info       0
Price              2671
Date                  0
Month                 0
Year                  0
Duration_hr           2
Duration_min          0
Arrival_hr            0
Arrival_min           0
Dep_hr                0
Dep_min               0
Total_Stop            0
dtype: int64

In [236]:
fdata.head(2)

,Airline,Source,Destination,Route,Total_Stops,Additional_Info,Price,Date,Month,Year,Duration_hr,Duration_min,Arrival_hr,Arrival_min,Dep_hr,Dep_min,Total_Stop
0,IndiGo,Banglore,New Delhi,BLR → DEL,non-stop,No info,3897.0,24,3,2019,2.0,50,1,10,22,20,0.0
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,2 stops,No info,7662.0,1,5,2019,7.0,25,13,15,5,50,2.0

In [238]:
fdata.drop('Total_Stops',axis=1,inplace=True)

In [239]:
fdata.head(2)

,Airline,Source,Destination,Route,Additional_Info,Price,Date,Month,Year,Duration_hr,Duration_min,Arrival_hr,Arrival_min,Dep_hr,Dep_min,Total_Stop
0,IndiGo,Banglore,New Delhi,BLR → DEL,No info,3897.0,24,3,2019,2.0,50,1,10,22,20,0.0
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,No info,7662.0,1,5,2019,7.0,25,13,15,5,50,2.0

In [240]:
fdata['Total_Stop']=fdata['Total_Stop'].astype(int)

In [241]:
fdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13354 entries, 0 to 13353
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Source           13354 non-null  object
 2   Destination      13354 non-null  object
 3   Route            13353 non-null  object
 4   Additional_Info  13354 non-null  object
 5   Price            10683 non-null  float64
 6   Date             13354 non-null  int32
 7   Month            13354 non-null  int32
 8   Year             13354 non-null  int32
 9   Duration_hr      13352 non-null  float64
 10  Duration_min     13354 non-null  int32
 11  Arrival_hr       13354 non-null  int32
 12  Arrival_min      13354 non-null  int32
 13  Dep_hr           13354 non-null  int32
 14  Dep_min          13354 non-null  int32
 15  Total_Stop       13354 non-null  int32
dtypes: float64(2), int32(9), object(5)
memory usage: 1.2+ MB

In [242]:
#DROP ROUTE COLUMN DUE TO NO NEED
fdata.drop('Route',axis=1,inplace=True)

In [243]:
fdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13354 entries, 0 to 13353
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Source           13354 non-null  object
 2   Destination      13354 non-null  object
 3   Additional_Info  13354 non-null  object
 4   Price            10683 non-null  float64
 5   Date             13354 non-null  int32
 6   Month            13354 non-null  int32
 7   Year             13354 non-null  int32
 8   Duration_hr      13352 non-null  float64
 9   Duration_min     13354 non-null  int32
 10  Arrival_hr       13354 non-null  int32
 11  Arrival_min      13354 non-null  int32
 12  Dep_hr           13354 non-null  int32
 13  Dep_min          13354 non-null  int32
 14  Total_Stop       13354 non-null  int32
dtypes: float64(2), int32(9), object(4)
memory usage: 1.1+ MB

In [245]:
fdata['Additional_Info'].head(20)

0                         No info
1                         No info
2                         No info
3                         No info
4                         No info
5                         No info
6     In-flight meal not included
7                         No info
8     In-flight meal not included
9                         No info
10                        No info
11                        No info
12                        No info
13    In-flight meal not included
14                        No info
15                        No info
16                        No info
17    In-flight meal not included
18                        No info
19    In-flight meal not included
Name: Additional_Info, dtype: object